app/Repositories/Repository/ComiteRepository.php

    public function consultarComitesPorNodo($id)
    {
        return Comite::select('codigo', 'fechacomite', 'comites.observaciones', 'comites.id', 'estados_comite.nombre AS estadocomite')
            ->join('comite_idea', 'comite_idea.comite_id', '=', 'comites.id')
            ->join('ideas', 'comite_idea.idea_id', '=', 'ideas.id')
            ->join('nodos', 'nodos.id', '=', 'ideas.nodo_id')
            ->leftJoin('estados_comite', 'estados_comite.id', '=', 'comites.estado_comite_id')
            ->where('nodos.id', $id)
            ->groupBy('comites.id')
            ->orderBy('comites.id', 'desc')
            ->get();
---
select `codigo`, `fechacomite`, `comites`.`observaciones`, `comites`.`id`, `estados_comite`.`nombre` as `estadocomite` from `comites` inner join `comite_idea` on `comite_idea`.`comite_id` = `comites`.`id` inner join `ideas` on `comite_idea`.`idea_id` = `ideas`.`id` inner join `nodos` on `nodos`.`id` = `ideas`.`nodo_id` left join `estados_comite` on `estados_comite`.`id` = `comites`.`estado_comite_id` where `nodos`.`id` = 1 group by `comites`.`id` order by `comites`.`id` desc

    public function updateGestorIdea($request, Idea $idea)
    {
        DB::beginTransaction();
        try {
            $idea->update([
                'gestor_id' => $request->txtgestor_id
            ]);
---
update `ideas` set `gestor_id` = '', `ideas`.`updated_at` = '2020-09-18 20:21:47' where `id` = 2069