app/Repositories/Repository/IdeaRepository.php

select MAX(id+1) AS max from `ideas`
---
    private function generarCodigoIdea($tipo, $idnodo)
    {
        $anho                       = Carbon::now()->isoFormat('YYYY');
        $tecnoparque                = sprintf("%02d", $idnodo);
        $id                         = Idea::selectRaw('MAX(id+1) AS max')->get()->last();