app/Helpers/NodoHelper.php

    public static function returnNodoUsuario()
    {
        if (\Session::get('login_role') == User::IsExperto() && isset(auth()->user()->experto->nodo_id)) {
            return User::IsExperto(). ' nodo ' . Nodo::userNodo(auth()->user()->experto->nodo_id)->first()->nombre;
        } else if (\Session::get('login_role') == User::IsDinamizador() && isset(auth()->user()->dinamizador->nodo_id)) {
            return User::IsDinamizador(). ' nodo ' . Nodo::userNodo(auth()->user()->dinamizador->nodo_id)->first()->nombre;
---
select * from `dinamizador` where `dinamizador`.`user_id` = 457 and `dinamizador`.`user_id` is not null limit 1

    public static function returnNameNodoUsuario()
    {
        if (\Session::get('login_role') == User::IsExperto() && isset(auth()->user()->experto->nodo_id)) {
            return Nodo::userNodo(auth()->user()->experto->nodo_id)->first()->nombre;
        } else if (\Session::get('login_role') == User::IsDinamizador() && isset(auth()->user()->dinamizador->nodo_id)) {
---
select * from `dinamizador` where `dinamizador`.`user_id` = 457 and `dinamizador`.`user_id` is not null limit 1