app/Imports/EmpresasImport.php

                    return $vTamanho;
                }

                $empresa = Empresa::where('nit', $nit)->first();
---
select * from `empresas` where `nit` = '899999034' limit 1