app/Imports/GestoresImport.php

select * from `gruposanguineos` where `nombre` = 'O+' limit 1
---
                    return $vGenero;
                }
                // Validar grupo sanguineo
                $queryGrupoSanguineo = GrupoSanguineo::where('nombre', $row['grupo_sanguineo'])->first();

select * from `users` where `documento` = '1090476580' limit 1
select * from `users` where `email` = 'carolinaduke94@gmail.com' limit 1
---
                    return $vLinea;
                }

                $user = User::where('documento', $documento)->withTrashed()->first();
                $user_email = User::where('email', $row['correo'])->withTrashed()->first();