app/Imports/IdeasImport.php

                    return $vTamannhoAlcance;
                }

                $idea = Idea::where('codigo_idea', $row['codigo_idea'])->first();
---
select * from `ideas` where `codigo_idea` is null limit 1