app/Imports/ProyectosImport.php

    public function collection(Collection $rows)
    {
        $validacion = null;
        try {
            foreach ($rows as $key => $row) {
                // quitar espacios a los campos que no los necesita
                $row['documento_gestor'] = str_replace(' ', '', $row['documento_gestor']);
                $row['documento_gestor'] = ltrim(rtrim($row['documento_gestor']));
                $row['talento_duenho'] = str_replace(' ', '', $row['talento_duenho']);
                $row['empresa_duenha'] = str_replace(' ', '', $row['empresa_duenha']);
                $row['grupo_investigacion_duenho'] = str_replace(' ', '', $row['grupo_investigacion_duenho']);

                // Validar número de documento del gestor
                $gestor = User::where('documento', $row['documento_gestor'])->withTrashed()->first();
---
select * from `users` where `documento` = '1090476580' limit 1

                    $row['otra_area_conocimento'] = null;
                }
                // Validar sublínea
                $sublinea = Sublinea::where('nombre', $row['sublinea'])->first();
---
select * from `sublineas` where `nombre` = 'Automatización e instrumentación' limit 1

    private function obtenerTalentosProyecto($talentos_ejecutores, $talento_lider)
    {
        // $talento_temporal = null;
        $talentos = array();
        if (count($talentos_ejecutores) != 0) {
            for ($i=0; $i < count($talentos_ejecutores) ; $i++) {
                $talento_temporal = User::where('documento', $talentos_ejecutores[$i])->withTrashed()->first();
---
select * from `users` where `documento` = '88135175' and `users`.`deleted_at` is null limit 1

    private function obtenerUsersPropietarios($users_duenhos)
    {
        $arrUsers = explode(',', $users_duenhos);
        $user_temporal = null;
        $duenhos = array();
        if (count($arrUsers) != 0) {
            for ($i=0; $i < count($arrUsers) ; $i++) {
                $user_temporal = User::where('documento', $arrUsers[$i])->withTrashed()->first();
---
select * from `users` where `documento` = '' and `users`.`deleted_at` is null limit 1

    private function obtenerEmpresasPropietarias($empresas_duenhas)
    {
        $arrEmpresas = explode(',', $empresas_duenhas);
        $empresa_temporal = null;
        $duenhos = array();
        if (count($arrEmpresas) != 0) {
            for ($i=0; $i < count($arrEmpresas) ; $i++) {
                $empresa_temporal = Empresa::where('nit', $arrEmpresas[$i])->first();
---
select * from `empresas` where `nit` = '88135175' limit 1

    private function getIdeaProyecto($codigo_idea, $key)
    {
        $idea_id = null;
        if ($codigo_idea == null) {
            $idea_id = Idea::where('codigo_idea', '#0000')->first()->id;
        } else {
            $idea = Idea::where('codigo_idea', $codigo_idea)->first();
---
select * from `ideas` where `codigo_idea` = '#0000' limit 1

    private function actualizarProyectoExistente($actividad, $row, $user_gestor, $idea_id, $area_conocimiento_id, $sublinea_id, $talentos)
    {
        $trl_esperado = $this->getTrlEsperado($row['trl_esperado']);
        $trl_obtenido = $this->getTrlObtenido($row['trl_obtenido']);

        $actividad->update([
            'gestor_id' => $user_gestor->gestor->id,
            // 'nodo_id' => $this->nodo,
            'nombre' => $row['nombre_proyecto'],
            'fecha_inicio' => $row['fecha_inicio'],
            'fecha_cierre' => $row['fecha_cierre'],
            'conclusiones' => $row['conclusiones'],
            'objetivo_general' => $row['objetivo_general']
        ]);

        $actividad->articulacion_proyecto->proyecto->update([
              'fase_id' => Fase::where('nombre', 'Cierre')->first()->id,
              'idea_id' => $idea_id,
              'areaconocimiento_id' => $area_conocimiento_id,
              'otro_areaconocimiento' => $row['otra_area_conocimento'],
              'sublinea_id' => $sublinea_id,
              'trl_esperado' => $trl_esperado,
              'reci_ar_emp' => $row['area_emprendiemiento_sena'] == 'SI' ? 1 : 0,
              'economia_naranja' => $row['economia_naranja'] == 'SI' ? 1 : 0,
              'tipo_economianaranja' => $row['economia_naranja'] == 'SI' ? $row['tipo_economia_naranja'] : null,
              'dirigido_discapacitados' => $row['proyecto_dirigido_discapacitados'] == 'SI' ? 1 : 0,
              'tipo_discapacitados' => $row['proyecto_dirigido_discapacitados'] == 'SI' ? $row['tipo_discapacitado'] : null,
              'art_cti' => $row['articulado_cti'] == 'SI' ? 1 : 0,
              'nom_act_cti' => $row['actor_cti'] == 'SI' ? $row[''] : null,
              'alcance_proyecto' => $row['alcance_proyecto'],
              'fabrica_productividad' => $row['fabrica_productividad'] == 'SI' ? 1 : 0,
              'trl_obtenido' => $trl_obtenido,
              'trl_prototipo' => $row['prototipo_producto'],
              'trl_modelo' => $row['modelo_negocio'],
              'trl_pruebas' => $row['pruebas_documentadas'],
              'trl_normatividad' => $row['evidencias_normatividad']
        ]);
---
select * from `articulacion_proyecto` where `articulacion_proyecto`.`actividad_id` = 1340 and `articulacion_proyecto`.`actividad_id` is not null limit 1
select * from `proyectos` where `proyectos`.`articulacion_proyecto_id` = 1111 and `proyectos`.`articulacion_proyecto_id` is not null limit 1
select * from `fases` where `nombre` = 'Cierre' limit 1

        $syncData = array();
        $syncData = $this->obtenerTalentosProyecto($talentos, $row['talento_interlocutor']);

        $actividad->articulacion_proyecto->talentos()->sync($syncData, true);

        // Primero objetivo especifico
        if ($actividad->objetivos_especificos->get(0) == null) {
---
delete from `articulacion_proyecto_talento` where `articulacion_proyecto_id` = 1111 and `talento_id` in (1430)
insert into `articulacion_proyecto_talento` (`articulacion_proyecto_id`, `created_at`, `talento_id`, `talento_lider`, `updated_at`) values (1111, '2020-09-30 23:48:58', 1430, 1, '2020-09-30 23:48:58')
select * from `objetivos_especificos` where `objetivos_especificos`.`actividad_id` = 1340 and `objetivos_especificos`.`actividad_id` is not null


        $users_propietarios = array();
        $users_propietarios = $this->obtenerUsersPropietarios($row['talento_duenho']);
        $actividad->articulacion_proyecto->proyecto->users_propietarios()->attach($users_propietarios);
---
insert into `propietarios` (`created_at`, `propietario_id`, `propietario_type`, `proyecto_id`, `updated_at`) values ('2020-09-30 23:49:00', 1526, 'App\User', 878, '2020-09-30 23:49:00'), ('2020-09-30 23:49:00', 1527, 'App\User', 878, '2020-09-30 23:49:00'), ('2020-09-30 23:49:00', 1528, 'App\User', 878, '2020-09-30 23:49:00')


        $grupos_duenhos = array();
        $grupos_duenhos = $this->obtenerGruposPropietarios($row['grupo_investigacion_duenho']);
        $actividad->articulacion_proyecto->proyecto->gruposinvestigacion()->attach($grupos_duenhos);
---
insert into `propietarios` (`created_at`, `propietario_id`, `propietario_type`, `proyecto_id`, `updated_at`) values ('2020-09-30 23:48:58', 116, 'App\Models\GrupoInvestigacion', 910, '2020-09-30 23:48:58'), ('2020-09-30 23:48:58', 118, 'App\Models\GrupoInvestigacion', 910, '2020-09-30 23:48:58')