app/Imports/TalentosImport.php

select * from `gruposanguineos` where `nombre` = 'O+' limit 1
---
                    return $vGenero;
                }
                // Validar grupo sanguineo
                $queryGrupoSanguineo = GrupoSanguineo::where('nombre', $row['grupo_sanguineo'])->first();

select * from `tipo_talentos` where `nombre` = 'Aprendiz SENA sin apoyo de sostenimiento' limit 1
---
                //     return $vGradoEscolaridad;
                // }
                // Validar tipo de talento
                $queryTipoTalento = TipoTalento::where('nombre', $row['tipo_talento'])->first();

select * from `tipo_formacion` where `nombre` = 'Tecnica' limit 1
---
                    return $vTipoTalento;
                }
                // Validar tipo de formación
                $queryTipoFormacion = TipoFormacion::where('nombre', $row['tipo_formacion'])->first();

select * from `tipo_estudio` where `nombre` = 'Pregrado' limit 1
---
                // }

                // Validar tipo de estudio
                $queryTipoEstudioUniversidad = TipoEstudio::where('nombre', $row['tipo_estudio_universidad'])->first();

select * from `users` where `documento` = '1091595322' limit 1
select * from `users` where `email` = 'corre@ficticio.com' limit 1
---
                //     }
                // }

                $user = User::where('documento', $documento)->withTrashed()->first();
                $user_email = User::where('email', $row['correo'])->withTrashed()->first();

select * from `tipo_talentos` where `nombre` = 'Aprendiz SENA sin apoyo de sostenimiento' limit 1
select * from `tipo_talentos` where `nombre` = 'Funcionario SENA' limit 1
select * from `tipo_talentos` where `nombre` = 'Instructor SENA' limit 1
---
    private function getEntidad($row, $tipo_talento)
    {
        $entidad_id = null;

        if ($tipo_talento != null) {
            if ($tipo_talento->nombre == TipoTalento::where('nombre', TipoTalento::IS_APRENDIZ_SENA_SIN_APOYO)->first()->nombre ||
            $tipo_talento->nombre == TipoTalento::where('nombre', TipoTalento::IS_APRENDIZ_SENA_CON_APOYO)->first()->nombre ||
            $tipo_talento->nombre == TipoTalento::where('nombre', TipoTalento::IS_EGRESADO_SENA)->first()->nombre ) {

                $entidad_id = Entidad::where('nombre', $row['centro_formacion'])->first();
                if ($entidad_id != null) {
                    $entidad_id = $entidad_id->id;
                }
            }

            if ($tipo_talento->nombre == TipoTalento::where('nombre', TipoTalento::IS_FUNCIONARIO_SENA)->first()->nombre) {
                $entidad_id = Entidad::where('nombre', $row['centro_formacion_funcionario'])->first();
                if ($entidad_id != null) {
                    $entidad_id = $entidad_id->id;
                }
            }

            if ($tipo_talento->nombre == TipoTalento::where('nombre', TipoTalento::IS_INSTRUCTOR_SENA)->first()->nombre) {

select * from `tipo_talentos` where `nombre` = 'Estudiante Universitario' limit 1
---
    private function getDatosUniversitarios($row, $tipo_talento, $tipo_estudio)
    {
        $universidad = null;
        $carrera = null;
        $tipo_estudio_id = null;
        if ($tipo_talento != null) {
            if ($tipo_talento->nombre == TipoTalento::where('nombre', TipoTalento::IS_ESTUDIANTE_UNIVERSITARIO)->first()->nombre) {

select * from `tipo_talentos` where `nombre` = 'Egresado SENA' limit 1
---
    private function getTipoFormacion($tipo_talento, $tipo_formacion) {
        $tipo_formacion_id = null;
        if ($tipo_talento != null) {
            if ($tipo_talento->nombre == TipoTalento::where('nombre', TipoTalento::IS_EGRESADO_SENA)->first()->nombre) {

select * from `tipo_talentos` where `nombre` = 'Funcionario SENA' limit 1
---
    private function getDependencia($row, $tipo_talento)
    {
        $dependencia = null;
        if ($tipo_talento != null) {
            if ($tipo_talento->nombre == TipoTalento::where('nombre', TipoTalento::IS_FUNCIONARIO_SENA)->first()->nombre) {

select * from `tipo_talentos` where `nombre` = 'Funcionario de empresa' limit 1
---
    private function getEmpresaFuncionario($row, $tipo_talento)
    {
        $empresa = null;
        if ($tipo_talento != null) {
            if ($tipo_talento->nombre == TipoTalento::where('nombre', TipoTalento::IS_FUNCIONARIO_EMPRESA)->first()->nombre) {