app/Listeners/User/Auth/LogSuccessfulLogin.php

update `users` set `ultimo_login` = '2020-09-25 07:59:31', `users`.`updated_at` = '2020-09-25 07:59:31' where `id` = 457
---
    public function handle(Login $event)
    {
        $event->user->ultimo_login = date('Y-m-d H:i:s');
        $event->user->save();