app/Http/Controllers/ComiteController.php

select * from `dinamizador` where `dinamizador`.`user_id` = 457 and `dinamizador`.`user_id` is not null limit 1
---
  public function index()
  {
    if ( Session::get('login_role') == User::IsInfocenter() ) {
      if (request()->ajax()) {
        $csibt = $this->getComiteRepository()->consultarComitesPorNodo( auth()->user()->infocenter->nodo_id );
        return datatables()->of($csibt)
        ->addColumn('details', function ($data) {
          $details = '<a class="btn m-b-xs" href="' . route('csibt.detalle', $data->id) . '"><i class="material-icons">search</i></a>';
          return $details;
        })->rawColumns(['details'])->make(true);
      }
      return view('comite.infocenter.index');
    } else if ( Session::get('login_role') == User::IsGestor() ) {
      if (request()->ajax()) {
        $csibt = $this->getComiteRepository()->consultarComitesPorNodo( auth()->user()->gestor->nodo_id );
        return datatables()->of($csibt)
        ->addColumn('details', function ($data) {
          $details = '<a class="btn m-b-xs" href="' . route('csibt.detalle', $data->id) . '"><i class="material-icons">search</i></a>';
          return $details;
        })->rawColumns(['details'])->make(true);
      }
      return view('comite.gestor.index');
    } else if ( Session::get('login_role') == User::IsAdministrador() ) {
      $nodos = Nodo::SelectNodo()->get();
      return view('comite.administrador.index', compact('nodos'));
    } else if ( Session::get('login_role') == User::IsDinamizador() ) {