app/Http/Controllers/CostoController.php

select * from `users` where `users`.`id` = 1490 limit 1
---
  private function getGestorActividad($actividad)
  {
    return $actividad->gestor->user()->withTrashed()->first()->nombres . " " . $actividad->gestor->user()->withTrashed()->first()->apellidos;