app/Http/Controllers/HomeController.php

    public function index()
    {

        // $nodo = auth()->user()->dinamizador->nodo->id;
        // $user = User::whereHas('gestor.nodo', function ($query) use ($nodo) {
        //         $query->where('id', $nodo);
        //     })->orWhereHas('infocenter.nodo', function ($query) use ($nodo) {
        //         $query->where('id', $nodo);
        //     })->orWhereHas('ingreso.nodo', function ($query) use ($nodo) {
        //         $query->where('id', $nodo);
        //     })->pluck('id');
        // dd($nododinamizador);
        //



        // $user = auth()->user()->dinamizador->nodo->infocenter->user;
        // dd($user);

      switch ( Session::get('login_role') ) {
        case User::IsAdministrador() :

            $dinamizadoresActivos = Dinamizador::with('user')
            ->whereHas('user', function($query){
                $query->where('estado', User::IsActive());
            })->get()->count();


            $gestoresActivos = Gestor::with('user')->whereHas('user', function($query){
                $query->where('estado', User::IsActive());
            })->get()->count();

            $talentosActivos = Talento::with('user')->get()->count();
---
select * from `dinamizador` where exists (select * from `users` where `dinamizador`.`user_id` = `users`.`id` and `estado` = 1 and `users`.`deleted_at` is null)
select * from `users` where `users`.`id` in (457, 1493, 2034, 2262, 2265, 2266, 2267, 2268, 2269, 2273, 2274, 2275, 2277, 2278, 2281, 2282, 2283, 2609, 2742) and `users`.`deleted_at` is null
select * from `users` where `users`.`id` in (1, 2, 4, 5, 6, 7, 8, 9, 10, 457, 821, 824, 825, 826, 829, 877, 878, 881, 882, 883, 884, 885, 887, 888, 954, 974, 985, 986, 987, 988, 989, 990, 991, 992, 993, 1088, 1089, 1090, 1091, 1092, 1094, 1095, 1096, 1097, 1098, 1099, 1100, 1101, 1207, 1209, 1211, 1212, 1214, 1216, 1217, 1218, 1407, 1408, 1489, 1490, 1491, 1492, 1493, 1494, 1582, 1583, 1584, 1585, 1590, 1654, 1738, 1739, 1742, 1743, 1781, 1782, 1784, 1785, 1787, 1788, 1790, 1791, 1864, 1865, 1866, 1867, 1868, 1869, 1872, 1873, 1874, 1875, 1876, 1879, 2030, 2031, 2032, 2033, 2034, 2066, 2069, 2130, 2132, 2133, 2134, 2200, 2202, 2204, 2263, 2271, 2272, 2279, 2284, 2286, 2291, 2292, 2293, 2295, 2296, 2297, 2298, 2299, 2301, 2302, 2330, 2331, 2333, 2370, 2421, 2513, 2520, 2522, 2622, 3033, 3106, 3107, 3587)
select * from `talentos`

            return view('home.administrador',[
              'countNodos' => Nodo::countNodos(),
              'countDinamizadoresActivos' => $dinamizadoresActivos,
              'totalDinamizadores' => Dinamizador::with('user')->get()->count(),
              'countGestoresActivos' =>  $gestoresActivos,
              'totalGestores' =>  Gestor::with('user')->get()->count(),
              'countTalentosActivos' =>  $talentosActivos,
              'totalTalentos' => Talento::with('user')->get()->count(),
---
select * from `dinamizador`
select * from `users` where `users`.`id` in (457, 1493, 2034, 2262, 2265, 2266, 2267, 2268, 2269, 2273, 2274, 2275, 2277, 2278, 2281, 2282, 2283, 2609, 2742) and `users`.`deleted_at` is null
select * from `gestores`
select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 152, 457, 671, 760, 766, 767, 819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 877, 878, 879, 880, 881, 882, 883, 884, 885, 886, 887, 888, 935, 954, 974, 985, 986, 987, 988, 989, 990, 991, 992, 993, 994, 1088, 1089, 1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100, 1101, 1102, 1206, 1207, 1208, 1209, 1210, 1211, 1212, 1213, 1214, 1215, 1216, 1217, 1218, 1406, 1407, 1408, 1409, 1410, 1411, 1489, 1490, 1491, 1492, 1493, 1494, 1581, 1582, 1583, 1584, 1585, 1586, 1587, 1588, 1589, 1590, 1654, 1738, 1739, 1740, 1741, 1742, 1743, 1781, 1782, 1783, 1784, 1785, 1786, 1787, 1788, 1789, 1790, 1791, 1864, 1865, 1866, 1867, 1868, 1869, 1870, 1871, 1872, 1873, 1874, 1875, 1876, 1877, 1878, 1879, 2026, 2027, 2028, 2029, 2030, 2031, 2032, 2033, 2034, 2066, 2069, 2130, 2131, 2132, 2133, 2134, 2200, 2201, 2202, 2203, 2204, 2263, 2271, 2272, 2279, 2284, 2286, 2289, 2291, 2292, 2293, 2295, 2296, 2297, 2298, 2299, 2301, 2302, 2330, 2331, 2333, 2370, 2421, 2513, 2520, 2522, 2622, 2862, 3033, 3106, 3107, 3587)
select * from `talentos`