app/Http/Controllers/HomeController.php

select * from `gestores` where exists (select * from `users` where `gestores`.`user_id` = `users`.`id` and `estado` = 1)
---
                    'totalDinamizadores' => $dinamizadores->get()->count(),
                    'countDinamizadoresActivos' => $dinamizadores->where('estado', User::IsActive())->get()->count(),
                    'totalGestores' =>  $expertos->get()->count(),
                    'countGestoresActivos' =>  $expertos->where('estado', User::IsActive())->get()->count(),