app/Http/Controllers/ProyectoController.php

    public function index()
    {

        switch (Session::get('login_role')) {
            case User::IsGestor():
                return view('proyectos.gestor.index');
                break;

            case User::IsDinamizador():
                return view('proyectos.dinamizador.index', [
                    'gestores' => Gestor::ConsultarGestoresPorNodo(auth()->user()->dinamizador->nodo_id)->pluck('nombres_gestor', 'id'),
                ]);
---
select `nodos`.`id`, CONCAT('Tecnoparque Nodo ',entidades.nombre) as nodos from `nodos` inner join `entidades` on `entidades`.`id` = `nodos`.`entidad_id`