app/Models/Nodo.php

    public function scopeCountNodos($query)
    {
        return $query->count();
---
select count(*) as aggregate from `nodos`